Autodesk.Revit.DB.BehaviorType
An enumerated type listing all the behavior type for MEP Components.

Autodesk.Revit.DB.BehaviorType.Damper
BehaviorType is a round centreline tap on oval straight

Autodesk.Revit.DB.BehaviorType.Oval_CentreLine_Tap
BehaviorType is a round centreline tap on oval straight

Autodesk.Revit.DB.BehaviorType.Round_CentreLine_Tap
BehaviorType is a round centreline tap on round straight/pipe

Autodesk.Revit.DB.BehaviorType.Coupling
BehaviorType is Coupling

Autodesk.Revit.DB.BehaviorType.Flat_Tap
BehaviorType is a flat tap on flat surface, eg. rectangular straight or flat-side of oval straight

Autodesk.Revit.DB.BehaviorType.Hanger
BehaviorType is Hanger

Autodesk.Revit.DB.BehaviorType.Flex
BehaviorType is Flex

Autodesk.Revit.DB.BehaviorType.Straight
BehaviorType is Straight

Autodesk.Revit.DB.BehaviorType.ElectricalBaseObject
BehaviorType is Electrical Base Object

Autodesk.Revit.DB.BehaviorType.VerticalBend
BehaviorType is Vertical Bend

Autodesk.Revit.DB.BehaviorType.MechanicalCoupling
BehaviorType is Mechanical Coupling

Autodesk.Revit.DB.BehaviorType.Flange
BehaviorType is Flange

Autodesk.Revit.DB.BehaviorType.Valve
BehaviorType is Valve

Autodesk.Revit.DB.BehaviorType.EndCap
BehaviorType is End Cap

Autodesk.Revit.DB.BehaviorType.BaseObject
BehaviorType is Base Object

Autodesk.Revit.DB.BehaviorType.SystemMember
BehaviorType is System Member

Autodesk.Revit.DB.BehaviorType.OrientToFace
BehaviorType is Orient to Face

Autodesk.Revit.DB.BehaviorType.OrientToCenterLine
BehaviorType is Orient to CenterLine

Autodesk.Revit.DB.BehaviorType.OrientToObject
BehaviorType is Orient to Object

Autodesk.Revit.DB.BehaviorType.BreakInto
BehaviorType is Break Into

Autodesk.Revit.DB.BehaviorType.Inline
BehaviorType is Inline

Autodesk.Revit.DB.BehaviorType.Intersection
BehaviorType is Intersection

Autodesk.Revit.DB.BehaviorType.Branch
BehaviorType is Branch

Autodesk.Revit.DB.BehaviorType.Bend
BehaviorType is Bend

Autodesk.Revit.DB.BehaviorType.Normal
BehaviorType is Normal

Autodesk.Revit.DB.BehaviorType.Invalid
BehaviorType is Invalid